# как пользователь может найти уже ранее загруженный файл по ключу?
class test_finding_file_by_key_form():
    def __init__(self, file_identification_key):
        pass



#новый файл успешно найден по введённому ключу пользователя
    #есть ли такой ключ в базе данных?
    ,find_file_by_key()
    #привязан ли такой ключ к какому-то файлу?
        #нет ли на один такой ключ двух и более файлов? Уникален ли ключ (это лучше на этапе присвоения ключа)
    .test_check_multyple_key_usage()
    #привязан ли такой ключ к уже удалённому файлу?
    .test_check_if_key_was_removed_file_using()
    